# EndSym

## Description
Procedure EndSym completes symbol creation in VectorScript. When EndSym is called, the any procedure calls defined since a call to BeginSym are used to create the symbol.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE EndSym;
```

```python

def vs.EndSym():
    return None
```

## Version
Availability: from MiniCAD
## Category
* Objects - Symbols